ЭкзаменационнаяЗадача/src/Documents/ОплатаПоставщику/ОплатаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщику</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ОплаченныеПоступления</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыПоступления</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПоступлениеКниг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/AccumulationRegisters/ОплаченныеПоступления/ОплаченныеПоступления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОплаченныеПоступления</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеКниг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЭкзаменационнаяЗадача/src/Documents/ПоступлениеКниг/ПоступлениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКниг</name>
  <registerRecords>AccumulationRegister.ОстаткиНомеклатуры</registerRecords>
  <registerRecords>AccumulationRegister.УчетПоступления</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКниг</name>
    <attributes>
      <name>НазваниеКниги</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/Documents/ОплатаПоставщику/Forms/ФормаВыбораНеОплаченныхДокументовПоступления/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеКниг.Дата КАК Дата,
		|	ПоступлениеКниг.Поставщик КАК Поставщик,
		|	ПоступлениеКниг.Сумма КАК Сумма,
		|	ПоступлениеКниг.Ссылка КАК Документ
		|ИЗ
		|	Документ.ПоступлениеКниг КАК ПоступлениеКниг
		|ГДЕ
		|	ПоступлениеКниг.Склад = &Склад
		|	И ПоступлениеКниг.Проведен
		|	И НЕ ПоступлениеКниг.Ссылка В
		|		(ВЫБРАТЬ
		|			ОплаченныеПоступления.Поступление КАК Поступление
		|		ИЗ
		|			РегистрНакопления.ОплаченныеПоступления КАК ОплаченныеПоступления)
		|	И ПоступлениеКниг.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
	Запрос.УстановитьПараметр("Поставщик", Параметры.Контрагент );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = НеОплаченныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура Выбрать(Команда)
	Выбор = Новый Массив;
	
	Для каждого ТекущаяСтрока Из НеОплаченныеДокументы Цикл
		Если ТекущаяСтрока.Выбрать Тогда
			Выбор.Добавить(ТекущаяСтрока);
		КонецЕсли;
					
	КонецЦикла;
	
	ОповеститьОВыборе(Выбор);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
